maoravni/Dev/FEC/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/uart/fsl_uart_hal_special_feature_configurations.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "fsl_uart_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_wait_mode_operation
 * Description   : Configure the UART to either operate or sieze to operate in WAIT mode.
 * The function configures the UART to either operate or seize to operate when WAIT mode is
 * entered.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
void  uart_hal_configure_wait_mode_operation(uint32_t uartInstance, uart_operation_config_t mode)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure uart operation in wait mode*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* In CPU wait mode: 0 - uart clocks continue to run; 1 - uart clocks freeze */
        BW_UART0_C1_DOZEEN(mode);
    }
    else
#endif
    {
        /*In CPU wait mode: 0 - uart is enabled; 1 - uart is disabled */
        BW_UART_C1_UARTSWAI(uartInstance, mode);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_get_wait_mode_operation_config
 * Description   : Determine if the UART operates or siezes to operate in WAIT mode.
 * This function returns kUartOperates if the UART has been configured to operate in WAIT mode.
 * Else it returns KUartStops if the UART has been configured to seize-to-operate in WAIT mode.
 *
 *END**************************************************************************/
uart_operation_config_t uart_hal_get_wait_mode_operation_config(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* get configuration uart operation in wait mode*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* In CPU wait mode: 0 - uart clocks continue to run; 1 - uart clocks freeze */
        if (HW_UART0_C1.B.DOZEEN==0)
        {
             return kUartOperates;
        }
        else
        {
             return kUartStops;
        }
    }
    else
#endif
    {
        /*In CPU wait mode: 0 - uart is enabled; 1 - uart is disabled */
        if (HW_UART_C1(uartInstance).B.UARTSWAI == 0)
        {
             return kUartOperates;
        }
        else
        {
             return kUartStops;
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_loopback_mode
 * Description   : Configure the UART loopback operation.
 * This function enables or disables the UART loopback operation.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
void uart_hal_configure_loopback_mode(uint32_t uartInstance, bool enable)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure uart to enable/disable operation in loopback mode*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* configure LOOPS bit to enable(1)/disable(0) loopback mode, but also need to clear RSRC*/
        BW_UART0_C1_LOOPS(enable);

        /* clear RSRC for loopback mode, and if loopback disabled,
         * this bit has no meaning but clear anyway
         * to set it back to default value
         */
        HW_UART0_C1_CLR(BM_UART0_C1_RSRC);
    }
    else
#endif
    {
        /* configure LOOPS bit to enable(1)/disable(0) loopback mode, but also need to clear RSRC */
        BW_UART_C1_LOOPS(uartInstance, enable);

        /* clear RSRC for loopback mode, and if loopback disabled,
         * this bit has no meaning but clear anyway
         * to set it back to default value
         */
        HW_UART_C1_CLR(uartInstance, BM_UART_C1_RSRC);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_singlewire_mode
 * Description   : Configure the UART single-wire operation.
 * This function enables or disables the UART single-wire operation.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
void uart_hal_configure_singlewire_mode(uint32_t uartInstance, bool enable)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure uart to enable/disable operation in single mode*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* to enable single-wire mode, need both LOOPS and RSRC set, to disable, clear both*/
        BW_UART0_C1_LOOPS(enable);
        BW_UART0_C1_RSRC(enable);
    }
    else
#endif
    {
        /* to enable single-wire mode, need both LOOPS and RSRC set, to disable, clear both*/
        BW_UART_C1_LOOPS(uartInstance, enable);
        BW_UART_C1_RSRC(uartInstance, enable);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_txdir_in_singlewire_mode
 * Description   : Configure the UART transmit direction while in single-wire mode.
 * This function configures the transmitter direction when the UART is configured for single-wire
 * operation.
 *
 *END**************************************************************************/
void uart_hal_configure_txdir_in_singlewire_mode(uint32_t uartInstance,
                                                 uart_singlewire_txdir_t direction)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* configure uart transmit direction (input or output) when in single-wire mode
     * it is assumed uart is in single-wire mode
     */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        BW_UART0_C3_TXDIR(direction);
    }
    else
#endif
    {
        BW_UART_C3_TXDIR(uartInstance, direction);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_put_receiver_in_standby_mode
 * Description   : Place the UART receiver in standby mode.
 * This function, when called, will place the UART receiver into standby mode.
 * In some UART instances, there is a condition that must be met before placing rx in standby mode.
 * Before placing UART in standby, you need to first determine if receiver is set to
 * wake on idle and if receiver is already in idle state. Per ref manual:
 * NOTE: RWU should only be set with C1[WAKE] = 0 (wakeup on idle) if the channel is currently
 * not idle.
 * This can be determined by the S2[RAF] flag. If set to wake up FROM an IDLE event and the channel
 * is already idle, it is possible that the UART will discard data since data must be received
 * (or a LIN break detect) after an IDLE is detected before IDLE is allowed to reasserted.
 *
 *END**************************************************************************/
uart_status_t uart_hal_put_receiver_in_standby_mode(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

