maoravni/Dev/FEC/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/uart/fsl_uart_hal_special_feature_configurations.c
    /* In some uart instances, there is a condition that must be met before placing
     * rx in standby mode.
     * Before placing uart in standby, need to first determine if receiver is set to
     * wake on idle and if receiver is already in idle state. Per ref manual:
     * NOTE: RWU should only be set with C1[WAKE] = 0 (wakeup on idle) if the channel is
     * currently not idle.
     * This can be determined by the S2[RAF] flag. If set to wake up an IDLE event and
     * the channel is already idle, it is possible that the UART will discard data since data
     * must be received (or a LIN break detect) after an IDLE is detected before IDLE is
     * allowed to reasserted.
     */
    uart_wakeup_method_t rxWakeMethod;
    bool uart_current_rx_state;

    /* see if wake is set for idle or */
    rxWakeMethod = uart_hal_get_receiver_wakeup_method(uartInstance);
    uart_current_rx_state = uart_hal_is_receiver_active(uartInstance);

    /* if both rxWakeMethod is set for idle and current rx state is idle, don't put in standy*/
    if ((rxWakeMethod == kUartIdleLineWake) && (uart_current_rx_state == 0))
    {
        return kStatus_UART_RxStandbyModeError;
    }
    else
    {
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
        if (uartInstance == 0)
        {
            /* set the RWU bit to place receiver into standby mode*/
            HW_UART0_C2_SET(BM_UART0_C2_RWU);
            return kStatus_UART_Success;
        }
        else
#endif
        {
            /* set the RWU bit to place receiver into standby mode*/
            HW_UART_C2_SET(uartInstance, BM_UART_C2_RWU);
            return kStatus_UART_Success;
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_put_receiver_in_normal_mode
 * Description   : Place the UART receiver in normal mode (disable standby mode operation).
 * This function, when called, will place the UART receiver into normal mode and out of
 * standby mode.
 *
 *END**************************************************************************/
void uart_hal_put_receiver_in_normal_mode(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* clear the RWU bit to place receiver into normal mode (disable standby mode)*/
        HW_UART0_C2_CLR(BM_UART0_C2_RWU);
    }
    else
#endif
    {
        /* clear the RWU bit to place receiver into normal mode (disable standby mode)*/
        HW_UART_C2_CLR(uartInstance, BM_UART_C2_RWU);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_receiver_in_standby
 * Description   : Determine if the UART receiver is currently in standby mode.
 * This function determines the state of the UART receiver. If it returns true, this means
 * that the UART receiver is in standby mode, otherwise if it returns false, the UART receiver
 * is in normal mode.
 *
 *END**************************************************************************/
bool uart_hal_is_receiver_in_standby(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* return the RWU bit setting (0 - normal more, 1 - standby)*/
        return HW_UART0_C2.B.RWU;
    }
    else
#endif
    {
        /* return the RWU bit setting (0 - normal more, 1 - standby)*/
        return HW_UART_C2(uartInstance).B.RWU;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_select_receiver_wakeup_method
 * Description   : Select the UART receiver wakeup method (idle line or addr-mark) from standby
 *                 mode.
 * This function configured the wakeup method of the UART receiver from standby mode.  The options
 * are idle-line wake or address-mark wake.
 *
 *END**************************************************************************/
void uart_hal_select_receiver_wakeup_method(uint32_t uartInstance, uart_wakeup_method_t method)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* configure the WAKE bit for idle line wake or address mark wake */
        BW_UART0_C1_WAKE(method);
    }
    else
#endif
    {
        /* configure the WAKE bit for idle line wake or address mark wake */
        BW_UART_C1_WAKE(uartInstance, method);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_get_receiver_wakeup_method
 * Description   : Get the UART receiver wakeup method (idle line or addr-mark) from standby mode.
 * This function returns how the UART recevier is configured to wake from standby mode. The
 * wake method options that can be returned are kUartIdleLineWake or kUartAddrMarkWake.
 *
 *END**************************************************************************/
uart_wakeup_method_t uart_hal_get_receiver_wakeup_method(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

        /* get configuration of the WAKE bit for idle line wake or address mark wake */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        if(HW_UART0_C1.B.WAKE == 1)
        {
            return kUartAddrMarkWake;
        }
        else
        {
            return kUartIdleLineWake;
        }
    }
    else
#endif
    {
        /* get configuration of the WAKE bit for idle line wake or address mark wake */
        if(HW_UART_C1(uartInstance).B.WAKE == 1)
        {
            return kUartAddrMarkWake;
        }
        else
        {
            return kUartIdleLineWake;
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_idle_line_detect
 * Description   : Configure the operation options of the UART idle line detect.
 * This function allows the user to configure the UART idle-line detect operation. There are two
 * separate operations for the user to configure, the idle line bit-count start and the receive
 * wake up affect on IDLE status bit. The user will pass in a stucture of type
 * uart_idle_line_config_t.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
void uart_hal_configure_idle_line_detect(uint32_t uartInstance,
                                         const uart_idle_line_config_t *config)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Configure the idle line detection configuration as follows:
     * configure the ILT to bit count after start bit or stop bit
     * configure RWUID to set or not set IDLE status bit upon detection of
     * an idle character when recevier in standby
     */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        BW_UART0_C1_ILT(config->idleLineType);
        BW_UART0_S2_RWUID(config->rxWakeIdleDetect);
    }
    else
#endif
    {
        BW_UART_C1_ILT(uartInstance, config->idleLineType);
        BW_UART_S2_RWUID(uartInstance, config->rxWakeIdleDetect);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_set_break_char_transmit_length
 * Description   : Configure the UART break character transmit length.
 * This function allows the user to configure the UART break character transmit length. Refer to
 * the typedef uart_break_char_length_t for setting options.
 * In some UART instances it is required that the transmitter should be disabled before calling
 * this function. Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
void uart_hal_set_break_char_transmit_length(uint32_t uartInstance,
                                             uart_break_char_length_t length)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Configure BRK13 - Break Character transmit length configuration
     * UART break character length setting:
     * 0 - minimum 10-bit times (default),
     * 1 - minimum 13-bit times
     */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        BW_UART0_S2_BRK13(length);
    }
    else
#endif
    {
        BW_UART_S2_BRK13(uartInstance, length);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_set_break_char_detect_length
 * Description   : Configure the UART break character detect length.
 * This function allows the user to configure the UART break character detect length. Refer to
 * the typedef uart_break_char_length_t for setting options.
 *
 *END**************************************************************************/
void uart_hal_set_break_char_detect_length(uint32_t uartInstance, uart_break_char_length_t length)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Configure LBKDE - Break Character detect length configuration
     * UART break character length setting:
     * 0 - minimum 10-bit times (default),
     * 1 - minimum 13-bit times
     */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        BW_UART0_S2_LBKDE(length);
    }
    else
#endif
    {
        BW_UART_S2_LBKDE(uartInstance, length);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_queue_break_char_to_send
 * Description   : Configure the UART transmit send break character operation.
 * This function allows the user to queue a UART break character to send.  If true is passed into
 * the function, then a break character will be queued for transmission.  A break character will
 * continuously be queued until this function is called again with a false is passed into this
 * function.
 *
 *END**************************************************************************/
void uart_hal_queue_break_char_to_send(uint32_t uartInstance, bool enable)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

