maoravni/Dev/FEC/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/uart/fsl_uart_hal_special_feature_configurations.c
    /* Configure SBK - Send Break
     * UART send break character setting:
     * 0 - normal transmitter operation,
     * 1 - Queue break character(s) to be sent
     */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        BW_UART0_C2_SBK(enable);
    }
    else
#endif
    {
        /* in addition to queuing a break char to send, this function also clears the
         * transmit complete status flag
         * for this uart instance, there is a two step process to
         * clear the transmit complete status flag:
         * 1. Read the status register with the status bit set
         * 2. queue a break character
         * first read the status register
         * no need to store the read value, it's assumed the status bit is set
         */
        HW_UART_S1_RD(uartInstance);
        /* second, queue a break character */
        BW_UART_C2_SBK(uartInstance, enable);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_match_address_operation
 * Description   : Configure the UART match address mode control operation. (Note: Feature
 *                 available on select UART instances)
 * The function allows the user to configure the UART match address control operation. The user
 * has the option to enable the match address mode and to program the match address value. There
 * are two match address modes, each with it's own enable and programmable match address value.
 *
 *END**************************************************************************/
uart_status_t uart_hal_configure_match_address_operation
(
    uint32_t uartInstance,
    bool matchAddrMode1,
    bool matchAddrMode2,
    uint8_t matchAddrValue1,
    uint8_t matchAddrValue2)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        BW_UART0_C4_MAEN1(matchAddrMode1); /* Match Address Mode Enable 1 */
        BW_UART0_C4_MAEN2(matchAddrMode2); /* Match Address Mode Enable 2 */
        HW_UART0_MA1_WR(matchAddrValue1); /* match address register 1 */
        HW_UART0_MA2_WR(matchAddrValue2); /* match address register 2 */
    }
    else
    {
        /* unsupported feature of this instance number, return error code */
        return kStatus_UART_InvalidInstanceNumber;
    }
#else
    BW_UART_C4_MAEN1(uartInstance, matchAddrMode1); /* Match Address Mode Enable 1 */
    BW_UART_C4_MAEN2(uartInstance, matchAddrMode2); /* Match Address Mode Enable 2 */
    HW_UART_MA1_WR(uartInstance, matchAddrValue1); /* match address register 1 */
    HW_UART_MA2_WR(uartInstance, matchAddrValue2); /* match address register 2 */
#endif

    return kStatus_UART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_send_msb_first_operation
 * Description   : Configre the UART to send data MSB first
 *                 (Note: Feature available on select UART instances)
 * The function allows the user to configure the UART to send data MSB first or LSB first.
 * In some UART instances it is required that the transmitter/receiver should be disabled
 * before calling this function.
 * Generally this may be applied to all UARTs to ensure safe operation.
 *
 *END**************************************************************************/
uart_status_t uart_hal_configure_send_msb_first_operation(uint32_t uartInstance, bool enable)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* Setting this bit reverses the order of the bits that are
         * transmitted and received on the wire.
         */
        BW_UART0_S2_MSBF(enable);
    }
    else
    {
        /* unsupported feature of this instance number, return error code */
        return kStatus_UART_MSBFirstNotSupported;
    }
#else

    BW_UART_S2_MSBF(uartInstance, enable);

#endif

    return kStatus_UART_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_receive_resync_disable_operation
 * Description   : Configuration option to disable the UART resynchronization during received data.
 *                 (Note: Feature available on select UART instances)
 * This function allows the user to disable the UART resync of received data. The default setting
 * of this is false meaning that resynchronization during the received data word is supported.
 * If the user passes in true, this disables resynchronization during the received data word.
 *
 *END**************************************************************************/
uart_status_t uart_hal_configure_receive_resync_disable_operation(uint32_t uartInstance,
                                                                  bool enable)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

#if FSL_FEATURE_UART_HAS_RX_RESYNC_SUPPORT
    if (uartInstance == 0)
    {
        /* When set, disables the resynchronization of the received data word when a data
         * one followed by data zero transition is detected. This bit should only be changed
         *  when the receiver is disabled.
         */
        BW_UART0_C5_RESYNCDIS(enable);

        return kStatus_UART_Success;
    }
    else
#endif
    {
        /* unsupported feature of this instance number, return error code */
        return kStatus_UART_ResyncNotSupported;
     }
}

#if FSL_FEATURE_UART_HAS_MODEM_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_receiver_rts
 * Description   : Enable the UART receiver request-to-send functionality.
 * This function allows the user to enable the UART receiver request-to-send (RTS) functionality.
 * By enabling, it allows the RTS output to control the CTS input of the transmitting device to
 * prevent receiver overrun. RTS is deasserted if the number of characters in the receiver data
 * register (FIFO) is equal to or greater than RWFIFO[RXWATER]. RTS is asserted when the
 * number of characters in the receiver data register (FIFO) is less than RWFIFO[RXWATER].
 * Do not set both RXRTSE and TXRTSE.
 *
 *END**************************************************************************/
void uart_hal_enable_receiver_rts(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Set RXRTSE */
    HW_UART_MODEM_SET(uartInstance, BM_UART_MODEM_RXRTSE);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_receiver_rts
 * Description   : Disable the UART receiver request-to-send functionality.
 * This function allows the user to disable the UART receiver request-to-send (RTS) functionality.
 *
 *END**************************************************************************/
void uart_hal_disable_receiver_rts(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Clear RXRTSE */
    HW_UART_MODEM_CLR(uartInstance, BM_UART_MODEM_RXRTSE);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_transmitter_rts
 * Description   : Enable the UART transmitter request-to-send functionality.
 * This function allows the user to enable the UART transmitter request-to-send (RTS) functionality.
 * When enabled, it allows the UART to control the RTS assertion before and after a transmission
 * such that when a character is placed into an empty transmitter data buffer , RTS
 * asserts one bit time before the start bit is transmitted. RTS deasserts one bit time after all
 * characters in the transmitter data buffer and shift register are completely sent, including
 * the last stop bit.
 *
 *END**************************************************************************/
void uart_hal_enable_transmitter_rts(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Set TXRTSE */
    HW_UART_MODEM_SET(uartInstance, BM_UART_MODEM_TXRTSE);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_transmitter_rts
 * Description   : Disable the UART transmitter request-to-send functionality.
 * This function allows the user to disable the UART transmitter request-to-send (RTS)
 * functionality.
 *
 *END**************************************************************************/
void uart_hal_disable_transmitter_rts(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

