maoravni/Dev/FEC/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/uart/fsl_uart_hal_special_feature_configurations.c
    /* Clear TXRTSE */
    HW_UART_MODEM_CLR(uartInstance, BM_UART_MODEM_TXRTSE);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_transmitter_rts_polarity
 * Description   : Configure the UART transmitter RTS polarity.
 * This function allows the user configure the transmitter RTS polarity to be either active low
 * or active high.
 *
 *END**************************************************************************/
void uart_hal_configure_transmitter_rts_polarity(uint32_t uartInstance, bool polarity)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Configure the transmitter rts polarity: 0=active low, 1=active high */
    BW_UART_MODEM_TXRTSPOL(uartInstance, polarity);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_transmitter_cts
 * Description   : Enable the UART transmitter clear-to-send functionality.
 * This function allows the user to enable the UART transmitter clear-to-send (CTS) functionality.
 * When enabled, he transmitter checks the state of CTS each time it is ready to send a character.
 * If CTS is asserted, the character is sent. If CTS is deasserted, the signal TXD remains in
 * the mark state and transmission is delayed until CTS is asserted. Changes in CTS as a
 * character is being sent do not affect its transmission.
 *
 *END**************************************************************************/
void uart_hal_enable_transmitter_cts(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Set TXCTSE */
    HW_UART_MODEM_SET(uartInstance, BM_UART_MODEM_TXCTSE);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_transmitter_cts
 * Description   : Disable the UART transmitter clear-to-send functionality.
 * This function allows the user to disable the UART transmitter clear-to-send (CTS)
 * functionality.
 *
 *END**************************************************************************/
void uart_hal_disable_transmitter_cts(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Clear TXCTSE */
    HW_UART_MODEM_CLR(uartInstance, BM_UART_MODEM_TXCTSE);
}
#endif  /* FSL_FEATURE_UART_HAS_MODEM_SUPPORT */

#if FSL_FEATURE_UART_HAS_IR_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_infrared_operation
 * Description   : Configure the UART infrared operation.
 * The function allows the user to enable or disable the UART infrared (IR) operation
 * and to configure the IR pulse width.
 *
 *END**************************************************************************/
void uart_hal_configure_infrared_operation(uint32_t uartInstance, bool enable,
                                           uart_ir_tx_pulsewidth_t pulseWidth)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* enable or disable infrared */
    BW_UART_IR_IREN(uartInstance, enable);

    /* configure the narrow pulse width of the IR pulse */
    BW_UART_IR_TNP(uartInstance, pulseWidth);
}
#endif  /* FSL_FEATURE_UART_HAS_IR_SUPPORT */

/*******************************************************************************
 * EOF
 ******************************************************************************/

